<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"c1096627ac6f85a63fb19558d7d1b91e05b9eb283febaefa58abb419566438e5","plan_job_ref":"Job Test terraform-refresh #68 at https://github.com/dflook/terraform-github-actions/actions/runs/16695493701","plan_out_hash":"f55cac868f3e2324959b8b1de3ae915ff4e34c25b82d6d7338bb56f32f4e318b","plan_hash":"859b81d3979b7b4e73d994e82b6ebf6e2412889e2c1ad84a2008688c8c981ce4","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #68](https://github.com/dflook/terraform-github-actions/actions/runs/16695493701)